##############################
# リストの転置
##############################
list(map(list,zip(*s)))

##############################
# 配列同士の演算
##############################
z = [x * y for (x, y) in zip(A, B)]

##############################
# ある条件の要素数
##############################
data = range(1, 10)
count = len([x for x in data if x % 3 == 0]) # 3の倍数をカウント
print(count)

##############################
# 要素の出現数
##############################
a = [2,2,2,3,4,3,1,2,1,3,1,2,1,2,2,1,2,1]
from collections import Counter
a = Counter(a)
for i in a.most_common(3):print(i)

# 一回のみなら
n = a.count(2)
print(n)

##############################
# 累積和
##############################
import numpy
myList = [1,2,3,4,5,6,7,8,9,10]
s = list(numpy.cumsum(myList))
print(s)
