##############################
# 複数の文字列を変換
##############################
S='54IZSB'
S = S.translate(str.maketrans("BSI","123"))
print(S)
# 543Z21

##############################
# 文字列の変換
##############################
S='54IZSB'
S = S.replace("54","12")
print(S)

##############################
# 10進数の各文字列の和
##############################
n = str(N)
ns = sum([int(i) for i in list(n)])

##############################
# NをD進数表記
##############################
N, D=27, 3
import numpy as np
N_D = np.base_repr(N,D)
print(N_D)


format(n, 'b')  #二進数表記

int('XXX', 4)   #n進数表記を10進数表記に

#########################
# BIT演算
#########################
# >>は*1/2 右シフト
x>>j
# <<は*2 左シフト
x<<j
#NOT
~x
#Union
x|y
#and
x&y
#xor
x^y
#mask
x&0011000
